package g6y116.volunteer

data class Area(val name: String, val code: String)

object Code {
    fun getSiDo(nameOrCode: String): Area? = 전국.find { it.name == nameOrCode || it.code == nameOrCode }

    fun getGooGun(siDoNameOrCode: String, GooGunNameOrCode: String): Area? = when(siDoNameOrCode) {
        "서울", "6110000" -> 서울.find { it.name == GooGunNameOrCode || it.code == GooGunNameOrCode }
        "인천", "6280000" -> 인천.find { it.name == GooGunNameOrCode || it.code == GooGunNameOrCode }
        "경기도", "6410000" -> 경기도.find { it.name == GooGunNameOrCode || it.code == GooGunNameOrCode }
        "강원도", "6420000" -> 강원도.find { it.name == GooGunNameOrCode || it.code == GooGunNameOrCode }
        "대전", "6300000" -> 대전.find { it.name == GooGunNameOrCode || it.code == GooGunNameOrCode }
        "충청북도", "6430000" -> 충청북도.find { it.name == GooGunNameOrCode || it.code == GooGunNameOrCode }
        "충청남도", "6440000" -> 충청남도.find { it.name == GooGunNameOrCode || it.code == GooGunNameOrCode }
        "부산", "6260000" -> 부산.find { it.name == GooGunNameOrCode || it.code == GooGunNameOrCode }
        "대구", "6270000" -> 대구.find { it.name == GooGunNameOrCode || it.code == GooGunNameOrCode }
        "울산", "6310000" -> 울산.find { it.name == GooGunNameOrCode || it.code == GooGunNameOrCode }
        "경상북도", "6470000" -> 경상북도.find { it.name == GooGunNameOrCode || it.code == GooGunNameOrCode }
        "경상남도", "6480000" -> 경상남도.find { it.name == GooGunNameOrCode || it.code == GooGunNameOrCode }
        "광주", "6290000" -> 광주.find { it.name == GooGunNameOrCode || it.code == GooGunNameOrCode }
        "전라북도", "6450000" -> 전라북도.find { it.name == GooGunNameOrCode || it.code == GooGunNameOrCode }
        "전라남도", "6460000" -> 전라남도.find { it.name == GooGunNameOrCode || it.code == GooGunNameOrCode }
        else -> null // 제주, 세종은 구군이 없음
    }

    fun getGooGunList(siDoNameOrCode: String): List<Area> = when(siDoNameOrCode) {
        "서울", "6110000" -> 서울
        "인천", "6280000" -> 인천
        "경기도", "6410000" -> 경기도
        "강원도", "6420000" -> 강원도
        "대전", "6300000" -> 대전
        "충청북도", "6430000" -> 충청북도
        "충청남도", "6440000" -> 충청남도
        "부산", "6260000" -> 부산
        "대구", "6270000" -> 대구
        "울산", "6310000" -> 울산
        "경상북도", "6470000" -> 경상북도
        "경상남도", "6480000" -> 경상남도
        "광주", "6290000" -> 광주
        "전라북도", "6450000" -> 전라북도
        "전라남도", "6460000" -> 전라남도
        else -> emptyList() // 제주, 세종은 구군이 없음
    }

    val 전국 = listOf<Area>(
        Area("전국", ""),
        Area("서울", "6110000"),
        Area("인천", "6280000"),
        Area("경기도", "6410000"),
        Area("강원도", "6420000"),
        Area("대전", "6300000"),
        Area("충청북도", "6430000"),
        Area("충청남도", "6440000"),
        Area("부산", "6260000"),
        Area("대구", "6270000"),
        Area("울산", "6310000"),
        Area("경상북도", "6470000"),
        Area("경상남도", "6480000"),
        Area("광주", "6290000"),
        Area("전라북도", "6450000"),
        Area("전라남도", "6460000"),
        Area("세종", "5690000"),
        Area("제주도", "6500000"),
    )

    val 경기도 = listOf<Area>(
        Area("전체", ""),
        Area("수원시", "3740000"),
        Area("성남시", "3780000"),
        Area("고양시", "3940000"),
        Area("용인시", "4050000"),
        Area("부천시", "3860000"),
        Area("안산시", "3930000"),
        Area("안양시", "3830000"),
        Area("남양주시", "3990000"),
        Area("화성시", "5530000"),
        Area("평택시", "3910000"),
        Area("의정부시", "3820000"),
        Area("시흥시", "4010000"),
        Area("파주시", "4060000"),
        Area("광명시", "3900000"),
        Area("김포시", "4090000"),
        Area("군포시", "4020000"),
        Area("광주시", "5540000"),
        Area("이천시", "4070000"),
        Area("양주시", "5590000"),
        Area("오산시", "4000000"),
        Area("구리시", "3980000"),
        Area("안성시", "4080000"),
        Area("포천시", "5600000"),
        Area("의왕시", "4030000"),
        Area("하남시", "4040000"),
        Area("여주시", "5700000"),
        Area("양평군", "4170000"),
        Area("동두천시", "3920000"),
        Area("과천시", "3970000"),
        Area("가평군", "4160000"),
        Area("연천군", "4140000"),
    )

    val 서울 = listOf<Area>(
        Area("전체", ""),
        Area("종로구", "3000000"),
        Area("중구", "3010000"),
        Area("용산구", "3020000"),
        Area("성동구", "3030000"),
        Area("광진구", "3040000"),
        Area("동대문구", "3050000"),
        Area("중랑구", "3060000"),
        Area("성북구", "3070000"),
        Area("강북구", "3080000"),
        Area("도봉구", "3090000"),
        Area("노원구", "3100000"),
        Area("은평구", "3110000"),
        Area("서대문구", "3120000"),
        Area("마포구", "3130000"),
        Area("양천구", "3140000"),
        Area("강서구", "3150000"),
        Area("구로구", "3160000"),
        Area("금천구", "3170000"),
        Area("영등포구", "3180000"),
        Area("동작구", "3190000"),
        Area("관악구", "3200000"),
        Area("서초구", "3210000"),
        Area("강남구", "3220000"),
        Area("송파구", "3230000"),
        Area("강동구", "3240000"),
    )

    val 부산 = listOf<Area>(
        Area("전체", ""),
        Area("중구", "3250000"),
        Area("서구", "3260000"),
        Area("동구", "3270000"),
        Area("영도구", "3280000"),
        Area("부산진구", "3290000"),
        Area("동래구", "3300000"),
        Area("남구", "3310000"),
        Area("북구", "3320000"),
        Area("해운대구", "3330000"),
        Area("사하구", "3340000"),
        Area("금정구", "3350000"),
        Area("강서구", "3360000"),
        Area("연제구", "3370000"),
        Area("수영구", "3380000"),
        Area("사상구", "3390000"),
        Area("기장군", "3400000"),
    )

    val 경상남도 = listOf<Area>(
        Area("전체", ""),
        Area("창원시", "5670000"),
        Area("진주시", "5310000"),
        Area("통영시", "5330000"),
        Area("사천시", "5340000"),
        Area("김해시", "5350000"),
        Area("밀양시", "5360000"),
        Area("거제시", "5370000"),
        Area("양산시", "5380000"),
        Area("의령군", "5390000"),
        Area("함안군", "5400000"),
        Area("창녕군", "5410000"),
        Area("고성군", "5420000"),
        Area("남해군", "5430000"),
        Area("하동군", "5440000"),
        Area("산청군", "5450000"),
        Area("함양군", "5460000"),
        Area("거창군", "5470000"),
        Area("합천군", "5480000"),
    )

    val 인천 = listOf<Area>(
        Area("전체", ""),
        Area("중구", "3490000"),
        Area("동구", "3500000"),
        Area("미추홀구", "3510000"),
        Area("연수구", "3520000"),
        Area("남동구", "3530000"),
        Area("부평구", "3540000"),
        Area("계양구", "3550000"),
        Area("서구", "3560000"),
        Area("강화군", "3570000"),
        Area("옹진군", "3580000"),
    )

    val 경상북도 = listOf<Area>(
        Area("전체", ""),
        Area("포항시", "5020000"),
        Area("경주시", "5050000"),
        Area("김천시", "5060000"),
        Area("안동시", "5070000"),
        Area("구미시", "5080000"),
        Area("영주시", "5090000"),
        Area("영천시", "5100000"),
        Area("상주시", "5110000"),
        Area("문경시", "5120000"),
        Area("경산시", "5130000"),
        Area("군위군", "5140000"),
        Area("의성군", "5150000"),
        Area("청송군", "5160000"),
        Area("영양군", "5170000"),
        Area("영덕군", "5180000"),
        Area("청도군", "5190000"),
        Area("고령군", "5200000"),
        Area("성주군", "5210000"),
        Area("칠곡군", "5220000"),
        Area("예천군", "5230000"),
        Area("봉화군", "5240000"),
        Area("울진군", "5250000"),
        Area("울릉군", "5260000"),
    )

    val 대구 = listOf<Area>(
        Area("전체", ""),
        Area("중구", "3410000"),
        Area("동구", "3420000"),
        Area("서구", "3430000"),
        Area("남구", "3440000"),
        Area("북구", "3450000"),
        Area("수성구", "3460000"),
        Area("달서구", "3470000"),
        Area("달성군", "3480000"),
    )

    val 충청남도 = listOf<Area>(
        Area("전체", ""),
        Area("천안시", "4490000"),
        Area("공주시", "4500000"),
        Area("보령시", "4510000"),
        Area("아산시", "4520000"),
        Area("서산시", "4530000"),
        Area("논산시", "4540000"),
        Area("계룡시", "5580000"),
        Area("연기군", "4560000"),
        Area("당진시", "4630000"),
        Area("금산군", "4550000"),
        Area("부여군", "4570000"),
        Area("서천군", "4580000"),
        Area("청양군", "4590000"),
        Area("홍성군", "4600000"),
        Area("예산군", "4610000"),
        Area("태안군", "4620000"),
    )

    val 전라남도 = listOf<Area>(
        Area("전체", ""),
        Area("목포시", "4800000"),
        Area("여수시", "4810000"),
        Area("순천시", "4820000"),
        Area("나주시", "4830000"),
        Area("광양시", "4840000"),
        Area("담양군", "4850000"),
        Area("곡성군", "4860000"),
        Area("구례군", "4870000"),
        Area("고흥군", "4880000"),
        Area("보성군", "4890000"),
        Area("화순군", "4900000"),
        Area("장흥군", "4910000"),
        Area("강진군", "4920000"),
        Area("해남군", "4930000"),
        Area("영암군", "4940000"),
        Area("무안군", "4950000"),
        Area("함평군", "4960000"),
        Area("영광군", "4970000"),
        Area("장성군", "4980000"),
        Area("완도군", "4990000"),
        Area("진도군", "5000000"),
        Area("신안군", "5010000"),
    )

    val 전라북도 = listOf<Area>(
        Area("전체", ""),
        Area("전주시", "4640000"),
        Area("군산시", "4670000"),
        Area("익산시", "4680000"),
        Area("정읍시", "4690000"),
        Area("남원시", "4700000"),
        Area("김제시", "4710000"),
        Area("완주군", "4720000"),
        Area("진안군", "4730000"),
        Area("무주군", "4740000"),
        Area("장수군", "4750000"),
        Area("임실군", "4760000"),
        Area("순창군", "4770000"),
        Area("고창군", "4780000"),
        Area("부안군", "4790000"),
    )

    val 충청북도 = listOf<Area>(
        Area("전체", ""),
        Area("청주시", "5710000"),
        Area("충주시", "4390000"),
        Area("제천시", "4400000"),
        Area("보은군", "4420000"),
        Area("옥천군", "4430000"),
        Area("영동군", "4440000"),
        Area("증평군", "5570000"),
        Area("진천군", "4450000"),
        Area("괴산군", "4460000"),
        Area("음성군", "4470000"),
        Area("단양군", "4480000"),
    )

    val 강원도 = listOf<Area>(
        Area("전체", ""),
        Area("춘천시", "4180000"),
        Area("원주시", "4190000"),
        Area("강릉시", "4200000"),
        Area("동해시", "4210000"),
        Area("태백시", "4220000"),
        Area("속초시", "4230000"),
        Area("삼척시", "4240000"),
        Area("홍천군", "4250000"),
        Area("횡성군", "4260000"),
        Area("영월군", "4270000"),
        Area("평창군", "4280000"),
        Area("정선군", "4290000"),
        Area("철원군", "4300000"),
        Area("화천군", "4310000"),
        Area("양구군", "4320000"),
        Area("인제군", "4330000"),
        Area("고성군", "4340000"),
        Area("양양군", "4350000"),
    )

    val 대전 = listOf<Area>(
        Area("전체", ""),
        Area("동구", "3640000"),
        Area("중구", "3650000"),
        Area("서구", "3660000"),
        Area("유성구", "3670000"),
        Area("대덕구", "3680000"),
    )

    val 광주 = listOf<Area>(
        Area("전체", ""),
        Area("동구", "3590000"),
        Area("서구", "3600000"),
        Area("남구", "3610000"),
        Area("북구", "3620000"),
        Area("광산구", "3630000"),
    )

    val 울산 = listOf<Area>(
        Area("전체", ""),
        Area("중구", "3690000"),
        Area("남구", "3700000"),
        Area("동구", "3710000"),
        Area("북구", "3720000"),
        Area("울주군", "3730000"),
    )
}